Repository: DemocracyClub/UK-Polling-Stations
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy, cy_gb

source: Description
cy: Disgrifiad

source: Provide information about the problem to help us improve our service:
cy: Darparwch wybodaeth am y broblem er mwyn ein helpu i wella ein gwasanaeth:

source: (Optional) Email address:
cy: Cyfeiriad e-bost (dewisol):

source: If you provide an email address, we may contact you to request more information or notify you of improvements related to this report. It will not be used for email marketing purposes.
cy: Os byddwch yn darparu cyfeiriad e-bost, efallai byddwn yn cysylltu â chi i ofyn am ragor o wybodaeth neu i roi gwybod i chi am welliannau yn ymwneud â'r adroddiad hwn. Ni fydd yn cael ei defnyddio at ddibenion marchnata.

# button to send a bug report
source: Send Report
cy: Anfon Adroddiad

source: Report a Problem
cy: Rhoi Gwybod am Broblem

source: Dashboard
cy: Dangosfwrdd

source: Postcode:
cy: Cod post:

source: Enter your postcode
cy: Rhowch eich cod post

source: Did you find this useful?
cy: A oedd hwn yn ddefnyddiol i chi?

source: Comments
cy: Sylwadau

source: Yes
cy: Oedd

source: No
cy: Nac oedd

source: Has this information made you more likely to vote?
cy: A yw'r wybodaeth hon wedi eich gwneud yn fwy tebygol o bleidleisio?

source: Can you tell us anything more?
cy: Allwch chi ddweud rhagor i ni?

source: Send feedback
cy: Anfon adborth

source: Uploads
cy: Uwchlwythiadau

source: level access
cy: mynediad gwastad

source: a temporary ramp for access
cy: ramp dros dro ar gyfer mynediad

source: a ramp for access
cy: ramp ar gyfer mynediad

source: Where Do I Vote?
cy: Ble Ydw i'n Pleidleisio?

source: Choose Your Address
cy: Dewiswch eich Cyfeiriad

source: Find my Polling Station
cy: Dod o hyd i fy Ngorsaf Bleidleisio

# not shown to general public
source: This is a staging site.
cy: Safle Llwyfannu yw hwn.

source: Language:
cy: Iaith:

source: Home
cy: Hafan

source: About Where Do I Vote?
cy: Ynglŷn â Ble Ydw i'n Pleidleisio?

source: About Democracy Club
cy: Ynglŷn â <span lang="en">Democracy Club</span>

source: Privacy
cy: Preifatrwydd

source: Contact Us
cy: Cysylltu â Ni

source: Contains OS data © Crown copyright and database right %(current_year)s
cy: Yn cynnwys data Arolwg Ordnans © Hawlfraint a hawliau cronfa ddata'r Goron %(current_year)s

source: Contains Royal Mail data © Royal Mail copyright and database right %(current_year)s
cy: Yn cynnwys data'r Post Brenhinol © Hawlfraint a hawliau cronfa ddata'r Post Brenhinol %(current_year)s

source: Contains National Statistics data © Crown copyright and database right %(current_year)s
cy: Yn cynnwys data Ystadegau Gwladol © Hawlfraint a hawliau cronfa ddata'r Goron %(current_year)s

source: Democracy Club logo
cy: Logo <span lang="en">Democracy Club</span>

source: Find your polling station
cy: Dod o hyd i'ch gorsaf bleidleisio
cy_gb: Dod o hyd i'ch gorsaf bleidleisio

# phone number link follows
source: Alternatively, contact The Electoral Office for Northern Ireland on
cy: Fel arall, cysylltwch â Swyddfa Etholiadol Gogledd Iwerddon ar

# phone number link follows
source: Alternatively, contact %(council)s on
cy: Fel arall, cysylltwch â %(council_aspirate)s ar

source: nearby parking
cy: lle parcio gerllaw

source: disabled parking
cy: parcio i'r anabl

source: a hearing loop installed
cy: mae dolen glyw wedi'i gosod

source: publicly accessible toilets
cy: toiledau cyhoeddus

source: The electoral services team have added a note about this station:
cy: Mae'r tîm gwasanaethau etholiadol wedi ychwanegu nodyn am yr orsaf hon:

source: Cancelled Election
cy: Etholiad wedi'i Ganslo

source: The poll for <strong>%(cancelled_election_name)s</strong> has been rescheduled.
cy: Mae'r etholiad ar gyfer <strong>%(cancelled_election_name)s</strong> wedi cael ei aildrefnu.

source: It will now take place on %(cancelled_election_rescheduled_date)s.
cy: Bydd bellach yn digwydd ar %(cancelled_election_rescheduled_date)s.

source: The poll for <strong>%(cancelled_election_name)s</strong> has been cancelled.
cy: Mae'r etholiad ar gyfer <strong>%(cancelled_election_name)s</strong> wedi cael ei ganslo.

source: For more information contact %(council)s on <strong><a href="tel:%(phone_number)s">%(phone_number)s</a></strong>.
cy: Am ragor o wybodaeth cysylltwch gyda %(council_aspirate)s ar <strong><a href="tel:%(phone_number)s">%(phone_number)s</a></strong>.

source: For more information contact %(council)s.
cy: Am ragor o wybodaeth, cysylltwch â %(council_aspirate)s.

source: The Electoral Office for Northern Ireland
cy: Swyddfa Etholiadol Gogledd Iwerddon

source: Council Contact info
cy: Manylion Cyswllt y Cyngor
cy_gb: Manylion Cyswllt y Cyngor

# abbr title attribute
source: Phone
cy: Ffôn

# Short for Phone:
source: P:
cy: Ff:
cy_gb: Ff:

# abbr title attribute
source: Email
cy: Ebost

source: Sorry, we can't find %(postcode)s
cy: Mae'n flin gennym, nid ydym yn gallu dod o hyd i%(postcode)s

source: This doesn't appear to be a valid postcode.
cy: Nid yw hwn yn edrych fel cod post dilys.

source: Find your Polling Station
cy: Dod o hyd i'ch gorsaf bleidleisio
cy_gb: Dod o hyd i'ch gorsaf bleidleisio

source: Report a problem with this page
cy: Rhoi gwybod am broblem gyda'r dudalen hon

source: You are entitled to support to help you cast your vote.
cy: Mae gennych hawl i gymorth i'ch helpu i fwrw eich pleidlais.

source: Each polling place is selected to ensure that everyone can access it.
cy: Mae pob man pleidleisio yn cael ei ddewis i sicrhau bod pawb yn gallu cael mynediad iddo.

source: Every polling station will have a wheelchair accessible polling booth. Pencils, magnifiers and large print ballot papers will be available. You can take your phone into the polling booth to use a magnifier or text-to-speech app. There will be a place to sit, if needed.
cy: Bydd gan bob gorsaf bleidleisio fwth pleidleisio hygyrch i gadeiriau olwyn. Bydd pensiliau, chwyddwydrau a phapurau pleidleisio print bras ar gael. Gallwch fynd â'ch ffôn i mewn i'r bwth pleidleisio i ddefnyddio chwyddwydr neu ap testun-i-leferydd. Bydd lle i eistedd, os oes angen.

source: Electoral Commission website
cy: wefan y Comisiwn Etholiadol

source: If you need help to complete your ballot paper, you can ask a member of staff at the station. You can also take a friend or relative to the polling station to help you. However, there are different rules for this depending on the election type and which UK nation live in. Visit the <a href="%(ec_url)s">%(electoral_commission_website)s</a> for further information.
cy: Os oes angen help arnoch i gwblhau eich papur pleidleisio, gallwch ofyn i aelod o staff yn yr orsaf. Gallwch hefyd fynd â ffrind neu berthynas i'r orsaf bleidleisio i'ch helpu. Fodd bynnag, mae rheolau gwahanol ar gyfer hyn yn ddibynnol ar y math o etholiad ac ym mha wlad yn y DU yr ydych yn byw. Ewch i <a href"%(ec_url)s">%(electoral_commission_website)s</a> am ragor o wybodaeth.

source: Your vote is yours alone, and you are entitled to secrecy. Do not allow anyone else to mark your ballot paper against your wishes.
cy: Eich pleidlais chi yn unig yw eich pleidlais, ac mae gennych hawl i gyfrinachedd. Peidiwch â gadael i unrhyw un arall farcio eich papur pleidleisio yn groes i’ch dymuniad chi.

source: If you aren't sure what to do, ask a member of staff at your polling station. They are there to help.
cy: Os nad ydych yn siŵr beth i'w wneud, gofynnwch i aelod o staff yn eich gorsaf bleidleisio. Maen nhw yno i helpu.

source: Useful links
cy: Dolenni defnyddiol

source: Voting at a polling station (Electoral Commission).
cy: Pleidleisio mewn gorsaf bleidleisio (Electoral Commission).

source: Voting with sight loss (RNIB).
cy: Pleidleisio gyda cholled golwg (RNIB).

source: Voting with learning disabilities or autism (My Vote My Voice).
cy: Pleidleisio ag anableddau dysgu neu awtistiaeth (My Vote My Voice).

source: Getting there
cy: Cyrraedd yno

source: The electoral services team have added a note about getting to this station:
cy: Mae'r tîm gwasanaethau etholiadol wedi ychwanegu nodyn am gyrraedd yr orsaf hon:

source: Your election (might) need you!
cy: Mae eich etholiad (o bosib) eich angen chi!

source: A lot of people are needed to make an election happen. Your council may be hiring polling station and counting staff for the upcoming elections. Contact %(council)s Electoral Services team to see if they need help.
cy: Mae angen nifer o bobl i wneud i etholiad ddigwydd. Mae'n bosib bod eich cyngor yn cyflogi staff gorsaf bleidleisio a chyfri ar gyfer yr etholiadau sydd ar ddod. Cysylltwch â thîm Gwasanaethau Etholiadau %(council)s i weld a oes angen help arnynt.

source: Add future elections in %(postcode)s to your calendar:
cy: Ychwanegwch etholiadau sydd ar ddod yn %(postcode)s ar eich calendr.

source: iCal feed
cy: Ffrwd iCal

source: Information on your candidates
cy: Gwybodaeth ar eich ymgeiswyr

# followed by link to whocanivotefor.co.uk, with that link text
source: You can find information on your candidates at
cy: Gallwch ddod o hyd i wybodaeth ar eich ymgeiswyr yn

source: Keeping you and fellow voters safe!
cy: Yn eich cadw chi a'ch cyd-bleidleiswyr yn ddiogel!

source: Local election teams will be doing everything they can to ensure voting in person on polling day is safe for everyone. This means there will be safety measures in place at polling stations to prevent the spread of COVID-19, many of which you’ll be very familiar with!
cy: Bydd timau etholiad lleol yn gwneud popeth y gallant i sicrhau bod pleidleisio mewn person ar ddiwrnod yr etholiad yn ddiogel i bawb. Golyga hynny y bydd yna fesurau diogelwch yn eu lle mewn gorsafoedd pleidleisio er mwyn atal lledaeniad COVID-19, nifer yr ydych eisoes yn gyfarwydd â hwy!

source: There will be a limit to the number of people allowed in a polling station at any given time to allow for <strong>social distancing</strong>.
cy: Bydd nifer cyfyngedig o bobl yn cael bod mewn gorsaf bleidleisio ar unrhyw adeg er mwyn gallu cadw <strong>pellter cymdeithasol</strong>.

source: Please remember your <strong>face covering</strong> - you will need this to enter the polling station and will be expected to wear it throughout.
cy: Cofiwch eich <strong>gorchudd wyneb</strong> - bydd angen hwn arnoch i fynd i mewn i'r orsaf bleidleisio a bydd disgwyl i chi ei wisgo yr holl amser.

source: Make sure to <strong>sanitise your hands</strong> before and after voting. In many places, sanitiser will be available but it may be a good idea to carry your own!
cy: Sicrhewch eich bod yn <strong>diheintio eich dwylo</strong> cyn ac ar ôl pleidleisio. Mewn nifer o leoedd, bydd diheintydd ar gael ond gallai fod yn syniad da dod â rhai eich hun!

source: Some polling stations will supply clean pencils for voters but it may be best to bring your own with you.
cy: Bydd rhai gorsafoedd pleidleisio yn darparu pensiliau glan ar gyfer pleidleiswyr ond gallai fod yn well dod ag un eich hun.

source: Polling Stations will be cleaned regularly by polling staff. You may need to wait while a booth is sanitised before you enter.
cy: Bydd Gorsafoedd Pleidleisio'n cael eu glanhau'n rheolaidd gan staff. Mae'n bosib y bydd angen i chi aros tra bod bwth yn cael ei lanhau cyn i chi fynd i mewn.

source: Polling Station staff may be working behind safety screens - this doesn’t mean you can’t <strong>ask for assistance if you require it!</strong>
cy: Mae'n bosib y bydd staff yr Orsaf Bleidleisio'n gweithio y tu ôl i sgriniau diogelwch - nid yw hynny'n golygu na allwch <strong>ofyn am gymorth os ydych angen!</strong>

source: With these new safety measures in place, it may take a little bit longer to vote than usual. Remember that if you are in the queue to vote before 10pm, you will still be able to vote even when polls officially close.
cy: Gyda'r mesurau diogelwch newydd hyn yn eu lle, mae'n bosib y bydd yn cymryd ychydig yn hirach nag arfer i bleidleisio. Cofiwch os ydych chi yn y ciw i bleidleisio cyn 10pm y byddwch yn dal i allu pleidleisio hyd yn oed pan fydd y bleidlais yn cau'n swyddogol.

source: Multiple elections are happening!
cy: Mae nifer o etholiadau'n digwydd!

source: Lucky you! There's more than one election taking place in your area.
cy: Am lwcus! Mae mwy nag un etholiad yn digwydd yn eich ardal chi.

# followed by link to whocanivotefor.co.uk, with that link text
source: Don't worry, you can vote in all of them at the same polling station and read about them at
cy: Peidiwch â phoeni, gallwch bleidleisio ym mhob un yn yr un orsaf bleidleisio a darllen amdanynt ar

source: We don't know of any upcoming elections in your area
cy: Nid ydym yn ymwybodol o unrhyw etholiadau sydd ar ddod yn eich ardal chi

source: We're not aware of any upcoming elections in your area.
cy: Nid ydym yn ymwybodol o unrhyw etholiadau sydd ar ddod yn eich ardal chi.

source: If you think there may be elections in your area, check your local <a href="%(council_website)s">council website</a> for more information, or contact %(council)s on <strong><a href="tel:%(council_phone)s">%(council_phone)s</a></strong>.
cy: Os ydych chi'n credu bod yna etholiadau yn eich ardal chi, gwiriwch wefan eich <a href="%(council_website)s">cyngor lleol</a> am ragor o wybodaeth, neu cysylltwch â %(council_aspirate)s ar <strong><a href="tel:%(council_phone)s">%(council_phone)s</a></strong>.

source: Vote on %(polling_day)s
cy: Pleidleisiwch ar %(polling_day)s

source: Vote on polling day
cy: Pleidleisiwch ar y diwrnod pleidleisio

source: You can vote in person at:
cy: Gallwch bleidleisio yn y cnawd yn:

source: Contact %(council)s
cy: Cysylltwch â %(council_aspirate)s

source: Your polling station address should be printed on your polling card, which is delivered by post before an election.
cy: Dylai cyfeiriad eich gorsaf bleidleisio fod wedi'i argraffu ar eich cerdyn pleidleisio, sy'n cael ei anfon yn y post cyn etholiad.

source: If you don't have a poll card, you need to contact your local council.
cy: Os nad oes gennych chi gerdyn pleidleisio, bydd angen i chi gysylltu â'ch cyngor lleol.

source: You can call %(council)s on <strong><a href="tel:%(council_phone)s">%(council_phone)s</a></strong> or <strong><a href="%(council_website)s">visit their website</a></strong>.
cy: Gallwch ffonio %(council)s ar <strong><a href="tel:%(council_phone)s">%(council_phone)s</a></strong> neu <strong><a href="%(council_website)s">ewch i'w gwefan</a></strong>.

source: Or, you need to contact %(council)s.
cy: Neu, mae angen i chi gysylltu â %(council_aspirate)s.

source: You need to be registered in order to vote
cy: Rhaid i chi fod wedi cofrestru er mwyn pleidleisio

source: If you aren't registered to vote visit
cy: Os nad ydych chi wedi cofrestru i bleidleisio, ewch i

source: https://www.gov.uk/register-to-vote
cy: https://www.gov.uk/cofrestru-i-bleidleisio

source: You don't need to register again if you've already registered at your current address.
cy: Nid oes angen i chi gofrestru eto os ydych chi eisoes wedi cofrestru yn eich cyfeiriad cyfredol.

source: It's about %(distance_in_miles)s miles away or a %(time_in_minutes)s minute walk from %(postcode)s.
cy: Mae tua %(distance_in_miles)s milltir i ffwrdd neu %(time_in_minutes)s o funudau ar droed o %(postcode)s.

source: It's about %(distance_in_miles)s miles away or a %(time_in_minutes)s minute drive from %(postcode)s.
cy: Mae tua %(distance_in_miles)s milltir i ffwrdd neu %(time_in_minutes)s o funudau yn y car o %(postcode)s.

source: Get <a href="%(google_maps_url)s" target="_top">walking/driving directions from Google</a> or <a href="%(cyclestreets_url)s" target="_top">cycling directions from CycleStreets</a>.
cy: Cael <a href="%(google_maps_url)s" target="_top">cyfarwyddiadau cerdded/gyrru ar Google</a> neu <a href="%(cyclestreets_url)s" target="_top">gyfarwyddiadau seiclo ar CycleStreets</a>.

source: You must vote at your assigned polling station.
cy: Rhaid i chi bleidleisio yn eich gorsaf bleidleisio ddynodedig.

source: Read more about voting in Northern Ireland
cy: Darllen mwy am bleidleiso yng Ngogledd Iwerddon

source: Read more about voting in Great Britain
cy: Darllen mwy am bleidleisio ym Mhrydain Fawr

source: You don't need your poll card to vote
cy: Nid oes angen eich cerdyn pleidleisio arnoch i bleidleisio

source: If you are registered to vote, but you don't have your poll card, you can go to the polling station and give them your name and address.
cy: Os ydych chi wedi cofrestru i bleidleisio ond nad oes gennych chi eich cerdyn pleidleisio, gallwch fynd i'r orsaf bleidleisio a rhoi eich enw a chyfeiriad iddyn nhw.

source: Photographic identification will be required to vote in English local elections, and parliamentary elections across the UK, on and after 4 May 2023.
cy: ydd angen dull adnabod ffotograffig i bleidleisio mewn etholiadau lleol yn Lloegr, ac etholiadau seneddol ar draws y DU, ar ac ar ôl 4 Mai 2023.

source: Learn more about photographic identification for voters on the website of the Electoral Commission.
cy: Dysgwch fwy am ddulliau adnabod ffotograffig ar gyfer pleidleiswyr ar wefan y Comisiwn Etholiadol.

source: Learn more on the website of the Electoral Commission.
cy: Dysgwch fwy ar wefan y Comisiwn Etholiadol.

source: You can apply for a free 'Voter Authority Certificate' if you do not already possess a valid ID.
cy: Gallwch wneud cais am 'Dystysgrif Awdurdod Pleidleiswyr' am ddim os nad ydych yn gwneud yn barod

source: Apply for free voter ID.
cy: Gwnewch gais am ID pleidleisio am ddim.

source: %(election_date)s Elections
cy: Etholiadau %(election_date)s

source: Polling stations are open from 7am to 10pm <strong>today</strong>.
cy: Mae gorsafoedd pleidleisio ar agor o 7yb i 10yh <strong>heddiw</strong>.

source: Polling stations are open from 7am to 10pm on <strong>%(day_of_week)s %(election_date)s</strong>.
cy: Mae gorsafoedd pleidleisio ar agor o 7yb i 10yh ar <strong>%(day_of_week)s %(election_date)s</strong>.

source: Your Polling Station
cy: Eich Gorsaf Bleidleisio
cy_gb: Eich Gorsaf Bleidleisio

source: Contact Your Council
cy: Cysylltwch â'ch Cyngor

source: Or, you need to contact your council. Residents in %(postcode)s may be in one of the following council areas:
cy: Neu, mae angen i chi gysylltu â'ch cyngor. Mae'n bosib bod trigolion yn %(postcode)s yn un o'r ardaloedd cyngor canlynol:

source: minute
cy_gb: munud

source: miles
cy_gb: milltir

source: Choose Your Address / Street
cy_gb: Dewis Eich Cyfeiriad / Stryd

source: Enter Your Postcode
cy_gb: Nodwch eich cod post

source: e.g. <a href="postcode/CF105AJ/">CF10 5AJ</a>
cy_gb: e.e. <a href="postcode/CF105AJ/">CF10 5AJ</a>

source: Your polling station
cy_gb: Eich gorsaf bleidleisio

source: Contact %(council_name)s
cy_gb: Cyswllt %(council_name)s

source: The polling station for <strong>%(postcode)s</strong> is:
cy_gb: Yr orsaf bleidleisio ar gyfer <strong>%(postcode)s</strong> yw:

source: It's about %(walk_dist)s away or a %(walk_time)s walk from %(postcode)s.
cy_gb: Mae'n bellter o tua %(walk_dist)s neu tua %(walk_time)s wrth gerdded o %(postcode)s.

source: Get walking directions
cy_gb: Cyfarwyddiadau cerdded

source: <p>We don't have data for your area, so you need to contact the council.</p> <p>You can call them on <strong><a href="tel:%(council_phone)s">%(council_phone)s</a></strong></p>
cy_gb: <p>Nid oes gennym ddata ar gyfer eich ardal chi, felly gwell ichi gysylltu a'r cyngor.</p> <p>Ffoniwch nhw ar <strong><a href="tel:%(council_phone)s">%(council_phone)s</a></strong></p>

source: <h3>You don't need your poll card to vote</h3> <p>If you don't have your poll card, you can go to the polling station and give them your name and address.</p> <p>You don't need any other form of ID.</p> <p>If you haven’t received a polling card but think you should have done, contact your council</p> <p><strong>Polling stations are open from 7am to 10pm on polling day.</strong></p> <p><a href="https://www.gov.uk/voting-in-the-uk/polling-stations" target="_blank"> Read more about voting in the UK </a></p>
cy_gb: <h3>Nid yw cerdyn pleidleisio yn angenrheidiol er mwyn pleidleisio</h3> <p>Os nad oes gennych gerdyn pleidleisio, gallwch fynd i'ch gorsaf bleidleisio a dweud eich enw a chyfeiriad.</p> <p>Nid oes angen cerdyn adnabod arnoch .</p> <p>Cysyllwch gyda'r cyngor os nad ydych wedi derbyn cerdyn pleidleisio</p> <p><strong>Mae gorsafoedd pleidleisio ar agor o 7y.b tan 10 y.h. ar ddiwrnod y bleidlais.</strong></p> <p><a href="https://www.gov.uk/voting-in-the-uk/polling-stations" target="_blank"> Darllen mwy am bleidleisio yn y D.U. </a></p>

source: <h3>You need to be registered in order to vote</h3> <p>If you aren’t registered to vote visit <a href="https://www.gov.uk/register-to-vote">https://www.gov.uk/register-to-vote</a>
cy_gb: <h3>Rhaid eich bod wedi cofrestru i bleidleisio</h3> <p>Os nad ydych wedi cofrestru i bleidleisio ewch i <a href="https://www.gov.uk/cofrestru-i-bleidleisio">https://www.gov.uk/cofrestru-i-bleidleisio</a>

source: <strong>before the 18th of April</strong>.</p>
cy_gb: <strong>cyn y 18fed o Ebrill 2016</strong>.</p>
